import { t } from 'gm-i18n'

const commonFields = {
  [t('基础')]: [
    { key: t('打印时间'), value: '{{打印时间}}' },
    { key: t('最早任务交期'), value: '{{最早任务交期}}' },
    { key: t('最晚任务交期'), value: '{{最晚任务交期}}' },
    { key: t('关联客户'), value: '{{关联客户}}' },
    { key: t('关联线路'), value: '{{关联线路}}' },
    { key: t('自定义'), value: '{{自定义}}' },
  ],
  [t('其他')]: [{ key: t('页码'), value: '{{当前页码}} / {{页码总数}}' }],
}

const tableFields = {
  [t('基础')]: [
    { key: t('序号'), value: '{{列.序号}}' },
    { key: t('自定义'), value: '{{列.自定义}}' },
  ],
  [t('成品')]: [
    { key: t('生产成品编码'), value: '{{列.生产成品编码}}' },
    { key: t('生产成品'), value: '{{列.生产成品}}' },
    { key: t('商品类型'), value: '{{列.商品类型}}' },
    {
      key: t('理论包装数量（基本单位）'),
      value: '{{列.理论包装数量_基本单位}}',
    },
    {
      key: t('理论包装数量（包装单位）'),
      value: '{{列.理论包装数量_包装单位}}',
    },
  ],
  [t('物料')]: [
    { key: t('物料编码'), value: '{{列.物料编码}}' },
    { key: t('物料名称'), value: '{{列.物料名称}}' },
    {
      key: t('理论用料数量（基本单位）'),
      value: '{{列.理论用料数量_基本单位}}',
    },
    {
      key: t('理论用料数量（生产单位）'),
      value: '{{列.理论用料数量_生产单位}}',
    },
  ],
  [t('工序')]: [{ key: t('指导配料'), value: '{{列.指导配料}}' }],
}

export default {
  commonFields,
  tableFields,
}
